In [40]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('index2018.csv')

In [3]:
df.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6269 entries, 0 to 6268
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    6269 non-null   object
 1   spx     6269 non-null   float64
 2   dax     6269 non-null   float64
 3   ftse    6269 non-null   float64
 4   nikkei  6269 non-null   float64
dtypes: float64(4), object(1)
memory usage: 245.0+ KB

In [5]:
df.isnull()

       date    spx    dax   ftse  nikkei
0     False  False  False  False   False
1     False  False  False  False   False
2     False  False  False  False   False
3     False  False  False  False   False
4     False  False  False  False   False
...     ...    ...    ...    ...     ...
6264  False  False  False  False   False
6265  False  False  False  False   False
6266  False  False  False  False   False
6267  False  False  False  False   False
6268  False  False  False  False   False

[6269 rows x 5 columns]

In [6]:
df.isnull().sum()

date      0
spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

# convert text to date

In [41]:
df.date.head()

0    07/01/1994
1    10/01/1994
2    11/01/1994
3    12/01/1994
4    13/01/1994
Name: date, dtype: object

In [47]:
df['date'] = pd.to_datetime(df['date'])
df.head()

        date     spx      dax     ftse    nikkei
0 1994-07-01  469.90  2224.95  3445.98  18124.01
1 1994-10-01  475.27  2225.00  3440.58  18443.44
2 1994-11-01  474.13  2228.10  3413.77  18485.25
3 1994-12-01  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [48]:
df.date.head()

0   1994-07-01
1   1994-10-01
2   1994-11-01
3   1994-12-01
4   1994-01-13
Name: date, dtype: datetime64[ns]

# setting the index

In [49]:
df.set_index('date',inplace=True)

In [50]:
df.head()

               spx      dax     ftse    nikkei
date
1994-07-01  469.90  2224.95  3445.98  18124.01
1994-10-01  475.27  2225.00  3440.58  18443.44
1994-11-01  474.13  2228.10  3413.77  18485.25
1994-12-01  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

# Time series Frequecy

In [51]:
#weekly,monthly,daily,business days 
df.asfreq('w')

               spx      dax     ftse    nikkei
date
1994-07-03  466.91  2132.12  3305.91  19811.88
1994-07-10  455.10  1977.67  2998.68  19744.75
1994-07-17     NaN      NaN      NaN       NaN
1994-07-24     NaN      NaN      NaN       NaN
1994-07-31     NaN      NaN      NaN       NaN
...            ...      ...      ...       ...
2017-12-31     NaN      NaN      NaN       NaN
2018-01-07     NaN      NaN      NaN       NaN
2018-01-14     NaN      NaN      NaN       NaN
2018-01-21     NaN      NaN      NaN       NaN
2018-01-28     NaN      NaN      NaN       NaN

[1231 rows x 4 columns]

In [52]:
df.asfreq('d')

                    spx       dax         ftse    nikkei
date
1994-07-01   469.900000   2224.95  3445.980000  18124.01
1994-07-02   471.760000   2095.11  3419.070000  20014.40
1994-07-03   466.910000   2132.12  3305.910000  19811.88
1994-07-04   450.880000   2184.89  3129.000000  19890.98
1994-07-05          NaN       NaN          NaN       NaN
...                 ...       ...          ...       ...
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-27          NaN       NaN          NaN       NaN
2018-01-28          NaN       NaN          NaN       NaN
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[8614 rows x 4 columns]

In [53]:
df.asfreq('b')

                    spx       dax         ftse    nikkei
date
1994-07-01   469.900000   2224.95  3445.980000  18124.01
1994-07-04   450.880000   2184.89  3129.000000  19890.98
1994-07-05          NaN       NaN          NaN       NaN
1994-07-06   458.210000   2131.80  3004.800000  21042.71
1994-07-07   448.380000   2049.10  2964.400000  20620.02
...                 ...       ...          ...       ...
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[6152 rows x 4 columns]

# Missing values

In [54]:
df.isnull().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

In [56]:
df.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

In [58]:
#There is no NaN values in the dataset

# simplifying dataset

In [59]:
#remove dax,ftse and nikkei and only select spx attribute

In [60]:
df['market value'] = df.spx

In [61]:
df.head()

               spx      dax     ftse    nikkei  market value
date
1994-07-01  469.90  2224.95  3445.98  18124.01        469.90
1994-10-01  475.27  2225.00  3440.58  18443.44        475.27
1994-11-01  474.13  2228.10  3413.77  18485.25        474.13
1994-12-01  474.17  2182.06  3372.02  18793.88        474.17
1994-01-13  472.47  2142.37  3360.01  18577.26        472.47

In [62]:
del df['dax']

In [63]:
df.head()

               spx     ftse    nikkei  market value
date
1994-07-01  469.90  3445.98  18124.01        469.90
1994-10-01  475.27  3440.58  18443.44        475.27
1994-11-01  474.13  3413.77  18485.25        474.13
1994-12-01  474.17  3372.02  18793.88        474.17
1994-01-13  472.47  3360.01  18577.26        472.47

In [64]:
del df['ftse'],df['nikkei'],df['spx']

In [65]:
df.head()

            market value
date
1994-07-01        469.90
1994-10-01        475.27
1994-11-01        474.13
1994-12-01        474.17
1994-01-13        472.47

# spliting the data into training set and test set

In [66]:
len(df)

6269

In [67]:
len(df*0.8)

6269

In [68]:
len((df)*0.8)

6269

In [69]:
int(len(df)*0.8)

5015

In [70]:
size = int(len(df) * 0.8)

In [71]:
size

5015

In [135]:
df.size

5015

In [136]:
df_train.size

5015

In [ ]:
#Again upload into new dataframe

In [159]:
df1 = pd.read_csv("index2018.csv")
df1

            date          spx       dax         ftse    nikkei
0     07/01/1994   469.900000   2224.95  3445.980000  18124.01
1     10/01/1994   475.270000   2225.00  3440.580000  18443.44
2     11/01/1994   474.130000   2228.10  3413.770000  18485.25
3     12/01/1994   474.170000   2182.06  3372.020000  18793.88
4     13/01/1994   472.470000   2142.37  3360.010000  18577.26
...          ...          ...       ...          ...       ...
6264  23/01/2018  2839.130362  13559.60  7731.827774  24124.15
6265  24/01/2018  2837.544008  13414.74  7643.428966  23940.78
6266  25/01/2018  2839.253031  13298.36  7615.839954  23669.49
6267  26/01/2018  2872.867839  13340.17  7665.541292  23631.88
6268  29/01/2018  2853.528411  13324.48  7671.533300  23629.34

[6269 rows x 5 columns]

In [139]:
df1.size

31345

In [142]:
df1.tail()

            date          spx       dax         ftse    nikkei
6264  23/01/2018  2839.130362  13559.60  7731.827774  24124.15
6265  24/01/2018  2837.544008  13414.74  7643.428966  23940.78
6266  25/01/2018  2839.253031  13298.36  7615.839954  23669.49
6267  26/01/2018  2872.867839  13340.17  7665.541292  23631.88
6268  29/01/2018  2853.528411  13324.48  7671.533300  23629.34

In [145]:
size1 = int(len(df1)*0.8)
size1

5015

In [148]:
#from beginig to specific row is training set
df2 = df1.iloc[:size1]
df2.tail()

            date          spx      dax     ftse    nikkei
5010  28/03/2013  1569.185872  7795.31  6411.74  12335.96
5011  29/03/2013  1569.185872  7795.31  6411.74  12397.91
5012  01/04/2013  1562.173837  7795.31  6411.74  12135.02
5013  02/04/2013  1570.252238  7943.87  6490.66  12003.43
5014  03/04/2013  1553.686978  7874.75  6420.28  12362.20

In [149]:
len(df2)

5015

In [150]:
# specific row to the rest is test set
df3 = df1.iloc[size1:]

In [152]:
df3.tail()

            date          spx       dax         ftse    nikkei
6264  23/01/2018  2839.130362  13559.60  7731.827774  24124.15
6265  24/01/2018  2837.544008  13414.74  7643.428966  23940.78
6266  25/01/2018  2839.253031  13298.36  7615.839954  23669.49
6267  26/01/2018  2872.867839  13340.17  7665.541292  23631.88
6268  29/01/2018  2853.528411  13324.48  7671.533300  23629.34

In [153]:
#To avoid overlapping check with traing.tail() and test.head()

In [154]:
df2.tail()

            date          spx      dax     ftse    nikkei
5010  28/03/2013  1569.185872  7795.31  6411.74  12335.96
5011  29/03/2013  1569.185872  7795.31  6411.74  12397.91
5012  01/04/2013  1562.173837  7795.31  6411.74  12135.02
5013  02/04/2013  1570.252238  7943.87  6490.66  12003.43
5014  03/04/2013  1553.686978  7874.75  6420.28  12362.20

In [155]:
df3.head()

            date          spx      dax     ftse    nikkei
5015  04/04/2013  1559.979316  7817.39  6344.11  12634.54
5016  05/04/2013  1553.278930  7658.75  6249.77  12833.64
5017  08/04/2013  1563.071269  7662.64  6276.94  13192.59
5018  09/04/2013  1568.607909  7637.51  6313.20  13192.35
5019  10/04/2013  1587.731827  7810.63  6387.37  13288.13

# Small try using numpy

In [157]:
df_num = df1

In [158]:
df_num.head(3)

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25

In [163]:
train = pd.DataFrame(np.random.randn(1000,3))
train

            0         1         2
0    0.528823 -0.418634  0.948805
1   -0.449655 -0.167977 -0.172910
2   -0.636756 -1.082558 -0.340098
3    0.288482 -0.548112 -0.936758
4   -0.168108  0.345494 -1.628925
..        ...       ...       ...
995 -0.498872  0.371543 -0.918099
996 -0.510665  1.232191 -0.026034
997 -1.641751 -0.037328 -0.638939
998  0.300024  0.598187 -1.081293
999  1.358320  0.542855  1.455451

[1000 rows x 3 columns]